02_Wave_InitialFlat_MediumMesh/Allrun
#!/bin/sh

# create the mesh
foamCleanPolyMesh
blockMesh

# create the intial time folder
cp -r 0_org 0

# Initialize the alpha_a field
#funkySetFields -time 0

# create C files for post-processing
postProcess -func writeCellCentres -time 0

# Decompose the case in order to run in parallel (on 16 cores)
#decomposePar

# Run sedFoam in parallel
#mpirun -np 16 sedFoam_rbgh -parallel > log&
